tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install command line utility software.
brew 'wget'
brew 'mackup'

# Install version control tools.
brew 'git'

# Install development languages and frameworks.
brew 'python3'
brew 'erlang'
brew 'go'
cask 'java'

# Install IDEs.
cask 'sublime-text'
cask 'intellij-idea'

# Install communication and collaboration tools.
cask 'skype'
cask 'slack'
cask 'dropbox'

# Install additional software.
cask 'google-chrome'
cask 'grammarly'
cask 'skim'
cask 'android-file-transfer'
cask 'flux'

# Install multimedia software.
cask 'spotify'
cask 'vlc'
cask 'plex-media-player'

# Install fonts.
cask 'font-fira-code'
cask 'font-fontawesome'
cask 'font-lobster-two'
cask 'font-open-sans'
cask 'font-cousine'